In [2]:
import pandas as pd

#Creamos los datos que va a contener nuestra tabla
data = [(1,"Kike","Roca",34,1,1.2,0.8,3,"01-01-2020"),
(1,"Kike","Roca",34,2,1,0.75,1,"02-01-2020"),
(1,"Kike","Roca",34,1,1.2,0.8,2,"03-01-2020"),
(2,"Roser","Gonzalez",32,2,1,0.75,4,"01-01-2020"),
(2,"Roser","Gonzalez",32,1,1.2,0.8,10,"02-01-2020"),
(2,"Roser","Gonzalez",32,1,1.2,0.8,2,"03-01-2020"),
(3,"Iona","Roca",1,3,5,4.2,10,"01-01-2020"),
(3,"Iona","Roca",1,3,5,4.2,5,"02-01-2020"),
(3,"Iona","Roca",1,3,5,4.2,2,"03-01-2020"),
(4,"Duna","DK",9,4,10,5,25,"09-11-2020")]
#Los labels/coumnas de la tabla
labels =["id_buyer","name","surname","age","id_product","price","cost","items_buyed","date"]

In [3]:
df = pd.DataFrame.from_records(data, columns= labels) #creamos un DataFrame desde los objectos credos a mano

In [4]:
df

,id_buyer,name,surname,age,id_product,price,cost,items_buyed,date
0,1,Kike,Roca,34,1,1.2,0.80,3,01-01-2020
1,1,Kike,Roca,34,2,1.0,0.75,1,02-01-2020
2,1,Kike,Roca,34,1,1.2,0.80,2,03-01-2020
3,2,Roser,Gonzalez,32,2,1.0,0.75,4,01-01-2020
4,2,Roser,Gonzalez,32,1,1.2,0.80,10,02-01-2020
5,2,Roser,Gonzalez,32,1,1.2,0.80,2,03-01-2020
6,3,Iona,Roca,1,3,5.0,4.20,10,01-01-2020
7,3,Iona,Roca,1,3,5.0,4.20,5,02-01-2020
8,3,Iona,Roca,1,3,5.0,4.20,2,03-01-2020
9,4,Duna,DK,9,4,10.0,5.00,25,09-11-2020

In [ ]:
#Vamos a separar la tabla en 3 conceptos

In [5]:
compradores = df.drop_duplicates(subset = "id_buyer", keep="first") #eliminamos los duplicados por ID
compradores

,id_buyer,name,surname,age,id_product,price,cost,items_buyed,date
0,1,Kike,Roca,34,1,1.2,0.80,3,01-01-2020
3,2,Roser,Gonzalez,32,2,1.0,0.75,4,01-01-2020
6,3,Iona,Roca,1,3,5.0,4.20,10,01-01-2020
9,4,Duna,DK,9,4,10.0,5.00,25,09-11-2020

In [7]:
compradores = compradores[["id_buyer","name","surname","age"]] #nos quedamos solo con los atributos del cliente
compradores

   id_buyer   name   surname  age
0         1   Kike      Roca   34
3         2  Roser  Gonzalez   32
6         3   Iona      Roca    1
9         4   Duna        DK    9

In [8]:
productos = df.drop_duplicates(subset = "id_product", keep="first")
productos = productos[["id_product","price","cost"]]
productos

   id_product  price  cost
0           1    1.2  0.80
1           2    1.0  0.75
6           3    5.0  4.20
9           4   10.0  5.00

In [9]:
productos["margin"] = productos["price"] - productos["cost"] #Calculamoms el margen de negocio al vuelo

In [10]:
productos

   id_product  price  cost  margin
0           1    1.2  0.80    0.40
1           2    1.0  0.75    0.25
6           3    5.0  4.20    0.80
9           4   10.0  5.00    5.00

In [11]:
compras = df[["id_buyer","id_product","items_buyed","date"]]
compras

   id_buyer  id_product  items_buyed        date
0         1           1            3  01-01-2020
1         1           2            1  02-01-2020
2         1           1            2  03-01-2020
3         2           2            4  01-01-2020
4         2           1           10  02-01-2020
5         2           1            2  03-01-2020
6         3           3           10  01-01-2020
7         3           3            5  02-01-2020
8         3           3            2  03-01-2020
9         4           4           25  09-11-2020

In [16]:
litProducto = [(1,"Libreta"),(2,'Ceras'), (3,'Juguete'),(4,'DentaStick')]
#Los labels/coumnas de la tabla
labelsP =["id_product","product"]
lu_product_aux = pd.DataFrame.from_records(litProducto, columns= labelsP)
lu_product_aux

   id_product     product
0           1     Libreta
1           2       Ceras
2           3     Juguete
3           4  DentaStick

In [19]:
#hacer join entre 2 tablas
productos_ok = pd.merge(productos,lu_product_aux, on="id_product",how="outer") # se indica los df que queremos unir. Por que campo on= y que tipo de join es

#how:
# -outer -> Indistintamente si estan en cualquiera de las 2 tablas
# -inner -> Solo los que estan en las 2 tablas
# -right -> Solo cuando encuentra la clave en el dataframe de la derecha
# -left -> Solo cuando encuentra la clave en el dataframe de la izquierda
productos_ok

   id_product  price  cost  margin     product
0           1    1.2  0.80    0.40     Libreta
1           2    1.0  0.75    0.25       Ceras
2           3    5.0  4.20    0.80     Juguete
3           4   10.0  5.00    5.00  DentaStick

In [22]:
df_aux = pd.merge(compras,compradores, on="id_buyer",how="outer")
df_aux

   id_buyer  id_product  items_buyed        date   name   surname  age
0         1           1            3  01-01-2020   Kike      Roca   34
1         1           2            1  02-01-2020   Kike      Roca   34
2         1           1            2  03-01-2020   Kike      Roca   34
3         2           2            4  01-01-2020  Roser  Gonzalez   32
4         2           1           10  02-01-2020  Roser  Gonzalez   32
5         2           1            2  03-01-2020  Roser  Gonzalez   32
6         3           3           10  01-01-2020   Iona      Roca    1
7         3           3            5  02-01-2020   Iona      Roca    1
8         3           3            2  03-01-2020   Iona      Roca    1
9         4           4           25  09-11-2020   Duna        DK    9

In [23]:
df_aux.groupby(by="id_product")["age"].describe()
#1 parametro: Nombre de columna por la que agrupa
#2 parametro: Nombre de columna del valor a aplicar la funci칩n
#3 parametro: Funci칩n. En este caso, max. Tambien podriamos usar:
# .mean() -> media
# .min() -> valor mas peque침o
# .count() -> conteo
# .describe() -> resumen estadistico agrupado (count, mean, std (desviaci칩n estandard), min, max,3 cuartiles)
# Hay muchas mas fuinciones. Ver https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

            count  mean       std   min   25%   50%   75%   max
id_product
1             4.0  33.0  1.154701  32.0  32.0  33.0  34.0  34.0
2             2.0  33.0  1.414214  32.0  32.5  33.0  33.5  34.0
3             3.0   1.0  0.000000   1.0   1.0   1.0   1.0   1.0
4             1.0   9.0       NaN   9.0   9.0   9.0   9.0   9.0